brew "ffmpeg"
brew "mutt"
brew "noti"
brew "pass"

cask "adobe-digital-editions"
cask "backblaze"
cask "dropbox"
cask "element"
cask "gemini"
cask "netnewswire"
cask "microsoft-teams"
cask "pocket-casts"
cask "steam"
cask "telegram"
cask "zulip"

mas "WireGuard", id: 1451685025
