tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "getantibody/tap"
tap "federico-terzi/espanso"

brew "asdf"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "blueutil"
brew "chruby"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "curl"
brew "exa"
brew "fd"
brew "federico-terzi/espanso/espanso"
brew "fzf"
brew "getantibody/tap/antibody"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "htop"
brew "httpie"
brew "hub"
brew "jid"
brew "jq"
brew "less"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "mas"
brew "moreutils"
brew "mtr"
brew "ncdu"
brew "nnn"
brew "nvm"
brew "openssl"
brew "pandoc"
brew "pipx"
brew "pstree"
brew "pyenv"
brew "python@3.9"
brew "ranger"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-install"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "sk"
brew "starship"
brew "switchaudio-osx"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "unixodbc"
brew "unp"
brew "unrar"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "appcleaner"
# Bartender 4 Cask not yet available
# cask "bartender"
cask "clipy"
cask "dash"
cask "eloston-chromium"
cask "fantastical"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "firefox"
cask "font-inconsolata-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "google-cloud-sdk"
cask "grandperspective"
cask "istat-menus"
cask "iterm2"
cask "joplin"
cask "keybase"
cask "krisp"
cask "slack"
cask "spectacle"
cask "spotify"
cask "syncthing"
cask "thunderbird"
cask "toggl"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Bumpr", id: 1166066070
mas "LastPass", id: 926036361
mas "Speedtest", id: 1153157709
mas "Pocket", id: 568494494
mas "Todoist", id: 585829637
