tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "getantibody/tap"

brew "awscli"
brew "bash"
brew "bat"
brew "chruby"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "getantibody/tap/antibody"
brew "git"
brew "httpie"
brew "hub"
brew "jid"
brew "jq"
brew "mas"
brew "moreutils"
brew "mtr"
brew "nvm"
brew "pandoc"
brew "pipx"
brew "pyenv"
brew "python"
brew "ranger"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-install"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "ssh-copy-id"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "unp"
brew "unrar"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "clipy"
cask "dash"
cask "fantastical"
cask "firefox-nightly"
cask "firefox"
cask "font-source-code-pro"
cask "grandperspective"
cask "istat-menus"
cask "iterm2"
cask "keybase"
cask "krisp"
cask "netnewswire"
cask "slack"
cask "spectacle"
cask "spotify"
cask "thunderbird"
cask "toggl"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

mas "Amphetamine", id: 937984704
mas "Bumpr", id: 1166066070
mas "LastPass", id: 926036361
mas "Speedtest", id: 1153157709
mas "Pocket", id: 568494494
mas "Todoist", id: 585829637
