# frozen_string_literal: true

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"

tap "cantino/mcfly"
tap "federico-terzi/espanso"
tap "martido/graph"
tap "sachaos/todoist"
tap "gtback/tap"

brew "antibody"
brew "asdf"
brew "awscli"
brew "bash"
brew "bat"
brew "blueutil"
brew "broot"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "curl"
brew "duf"
brew "dust"
brew "enchant"
brew "exa"
brew "fd"
brew "federico-terzi/espanso/espanso"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hub"
brew "jc"
brew "jid"
brew "jq"
brew "lastpass-cli"
brew "less"
brew "libxslt"
brew "mas"
brew "mcfly"
brew "moreutils"
brew "mtr"
brew "ncdu"
brew "nnn"
brew "noti"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "procs"
brew "pstree"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "sachaos/todoist/todoist"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "shpotify"
brew "sk"
brew "starship"
# Needed to install some fonts
brew "subversion"
brew "switchaudio-osx"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "tree"
brew "unp"
brew "unrar"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli@1"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "clipy"
cask "dash"
cask "eloston-chromium"
cask "fantastical"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "firefox"
cask "font-inconsolata-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "grandperspective"
cask "istat-menus"
cask "iterm2"
cask "joplin"
cask "keybase"
cask "lastpass"
cask "rectangle"
cask "slack"
cask "spotify"
cask "syncthing"
cask "thunderbird"
cask "toggl"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Bumpr", id: 1166066070
# Do not install LastPass from the Mac App Store; it's really old; use the Cask instead.
# mas "LastPass", id: 926036361
mas "Speedtest", id: 1153157709
mas "Pocket", id: 568494494
mas "Todoist", id: 585829637
